zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_scb_uart.h
/*******************************************************************************
* Function Name: Cy_SCB_UART_DisableSkipStart
****************************************************************************//**
*
* Disable the skip start-bit functionality.
* See \ref Cy_SCB_UART_EnableSkipStart for the details.
*
* \param base
* The pointer to the UART SCB instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SCB_UART_DisableSkipStart(CySCB_Type *base)
{
    SCB_UART_RX_CTRL(base) &= (uint32_t) ~SCB_UART_RX_CTRL_SKIP_START_Msk;
}

#if (CY_SCB_UART_RX_HALF_DUPLEX_SUPPORTED) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SCB_UART_EnableSingleWireHalfDuplex
****************************************************************************//**
*
* Enables Single Wire Half Duplex Communication.
* \note This is applicable in standard UART submode only.
*
* \param base
* The pointer to the UART SCB instance.
*
* \note
* This API is available for PSoC C3 (CAT1B) devices.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SCB_UART_EnableSingleWireHalfDuplex(CySCB_Type *base)
{
    SCB_UART_RX_CTRL(base) |= SCB_UART_RX_CTRL_HDRXEN_Msk;
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_DisableSingleWireHalfDuplex
****************************************************************************//**
*
* Disables Single Wire Half Duplex Communication.
* \note This is applicable in standard UART submode only.
*
* \param base
* The pointer to the UART SCB instance.
*
* \note
* This API is available for PSoC C3 (CAT1B) devices.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SCB_UART_DisableSingleWireHalfDuplex(CySCB_Type *base)
{
    SCB_UART_RX_CTRL(base) &= (uint32_t) ~SCB_UART_RX_CTRL_HDRXEN_Msk;
}
#endif /* (CY_SCB_UART_RX_HALF_DUPLEX_SUPPORTED) || defined (CY_DOXYGEN) */

/** \} group_scb_uart_general_functions */


/**
* \addtogroup group_scb_uart_low_level_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_SCB_UART_GetOverSample
****************************************************************************//**
*
* Returns the value of oversample.
*
* \param base
* The pointer to the UART SCB instance.
*
* \return
* The value of oversample.
*
* \snippet scb/uart_snippet/main.c UART_GET_OVS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SCB_UART_GetOverSample(CySCB_Type const *base)
{
    return (_FLD2VAL(SCB_CTRL_OVS, SCB_CTRL(base))+1UL);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_GetDataWidth
****************************************************************************//**
*
* Returns the value of datawidth.
*
* \param base
* The pointer to the UART SCB instance.
*
* \return
* The value of datawidth.
*
* \note
* Values of Tx and Rx datawidth are same.
*
* \snippet scb/uart_snippet/main.c UART_GET_DATA_WIDTH
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SCB_UART_GetDataWidth(CySCB_Type const *base)
{
    return (_FLD2VAL(SCB_TX_CTRL_DATA_WIDTH, SCB_TX_CTRL(base))+1UL);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_GetParity
****************************************************************************//**
*
* Returns the value of parity.
*
* \param base
* The pointer to the UART SCB instance.
*
* \return
* The value of parity.
*
* \note
* Values of Tx and Rx parity are same.
*
* \snippet scb/uart_snippet/main.c UART_GET_PARITY
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SCB_UART_GetParity(CySCB_Type const *base)
{
    return _FLD2VAL(CY_SCB_UART_TX_CTRL_SET_PARITY, SCB_UART_TX_CTRL(base));
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_GetStopBits
****************************************************************************//**
*
* Returns the value of stop bits.
*
* \param base
* The pointer to the UART SCB instance.
*
* \return
* The value of stop bits.
*
* \note
* Values of Tx and Rx stop bits are same.
*
* \snippet scb/uart_snippet/main.c UART_GET_STOP_BITS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SCB_UART_GetStopBits(CySCB_Type const *base)
{
    return (_FLD2VAL(SCB_UART_TX_CTRL_STOP_BITS, SCB_UART_TX_CTRL(base))+1UL);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_GetDropOnParityError
****************************************************************************//**
*
* Returns the value of SetDropOnParityError.
*
* \param base
* The pointer to the UART SCB instance.
*
* \return
* The value of SetDropOnParityError.
*
* \snippet scb/uart_snippet/main.c UART_GET_DROP_ON_PARITY_ERROR
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SCB_UART_GetDropOnParityError(CySCB_Type const *base)
{
    return _FLD2BOOL(SCB_UART_RX_CTRL_DROP_ON_PARITY_ERROR, SCB_UART_RX_CTRL(base));
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_GetEnableMsbFirst
****************************************************************************//**
*
* Returns the value of enableMsbFirst.
*
* \param base
* The pointer to the UART SCB instance.
*
* \return
* The value of enableMsbFirst.
*
* \note
* Values of Tx and Rx enableMsbFirst are same.
*
* \snippet scb/uart_snippet/main.c UART_GET_ENABLE_MSB_FIRST
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SCB_UART_GetEnableMsbFirst(CySCB_Type const *base)
{
    return _FLD2BOOL(SCB_TX_CTRL_MSB_FIRST, SCB_TX_CTRL(base));
}


